# Frame Constructor

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Frame Constructor
Frame Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Frame()()()() | Default constructor. Uses global origin and standard basis vectors. |
| Frame(XYZ, XYZ, XYZ, XYZ) | Constructor that takes the frame's base point and three basis vectors. |

# See Also
Frame Class
Frame Members
Autodesk.Revit.DB Namespace